<?php
/*
* +----------------------------------------------------------------------+
* | Copyright (c) 国美互联网 - 视频事业部
* +----------------------------------------------------------------------+
* | All rights reserved.
* +----------------------------------------------------------------------+
* | @程序名称：AdminBase.php
* +----------------------------------------------------------------------+
* | @程序功能：
* +----------------------------------------------------------------------+
* | Author:JadeGlorious <wujing01@gomeplus.com>
* +----------------------------------------------------------------------+
* | Date: 2017/4/21 18:32
* +----------------------------------------------------------------------+
*/
abstract class AppBaseController extends BaseController
{
	public function init()
	{
		/*$this->assign('global', [
			//'menus'       => Registry::get('config')->menu->toArray(),
			'controller' => $this->_request->getControllerName(),
			'action'     => $this->_request->getActionName()
		]);*/
	}

}
 