<?php

/*
* +----------------------------------------------------------------------+
* | Copyright (c) 国美互联网 - 视频事业部
* +----------------------------------------------------------------------+
* | All rights reserved.
* +----------------------------------------------------------------------+
* | @程序名称：Index.php
* +----------------------------------------------------------------------+
* | @程序功能：
* +----------------------------------------------------------------------+
* | Author:JadeGlorious <wujing01@gomeplus.com>
* +----------------------------------------------------------------------+
* | Date: 2017/4/19 11:03
* +----------------------------------------------------------------------+
*/

class IndexController extends Yaf\Controller_Abstract
{
	public function indexAction()
	{
		echo "Hello api World! </br>";
		print_r(Yaf\Registry::get('config'));
		//echo "Hello World";
		//$this->_view->content = "hello world";
		//默认Action
		//$this->getView()->assign("content", "Hello World");
	}

}

 